Catalogs/Классификаторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Классификаторы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Упаковки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Классификаторы/Ext/ManagerModule.bsl
Функция Обновить(Классификаторы) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Классификатор Из Классификаторы Цикл
		КлассификаторСсылка = Справочники.Классификаторы.НайтиПоКоду(Классификатор.Код);
		
		Если КлассификаторСсылка.Пустая() Тогда
			КлассификаторОбъект = Справочники.Классификаторы.СоздатьЭлемент();
		Иначе
			КлассификаторОбъект = КлассификаторСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		КлассификаторОбъект.Код = Классификатор.Код;
		КлассификаторОбъект.Наименование = Классификатор.Наименование;
		КлассификаторОбъект.ПолноеНаименование = Классификатор.Наименование;
		КлассификаторОбъект.Бренд = Классификатор.Бренд;
		КлассификаторОбъект.ШтрихКод = Классификатор.ШтрихКод;
		КлассификаторОбъект.Записать();
		
		Для Каждого Упаковка Из Классификатор.Упаковки Цикл
			УпаковкСсылка = Справочники.Упаковки.НайтиПоКоду(XMLСтрока(Упаковка.Код),,, КлассификаторОбъект.Ссылка);
			
			Если УпаковкСсылка.Пустая() Тогда
				УпаковкаОбъект = Справочники.Упаковки.СоздатьЭлемент();
			Иначе
				УпаковкаОбъект = УпаковкСсылка.ПолучитьОбъект();
			КонецЕсли;
			
			УпаковкаОбъект.Код = Упаковка.Код;
			УпаковкаОбъект.Наименование = Упаковка.Наименование;
			УпаковкаОбъект.Владелец = КлассификаторОбъект.Ссылка;
			УпаковкаОбъект.Записать();
		КонецЦикла;
		
		Если КлассификаторОбъект.Упаковка.Пустая() Тогда
			КлассификаторОбъект.Упаковка = УпаковкаОбъект.Ссылка;
			КлассификаторОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции

Функция Получить(Номенклатура) Экспорт
	КлассификаторСсылка = Справочники.Классификаторы.НайтиПоКоду(Номенклатура.КодИКПУ);
	
	Если КлассификаторСсылка.Пустая() = Ложь Тогда
		Возврат КлассификаторСсылка.Упаковка;
	КонецЕсли;
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ПолноеНаименование");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.ПолноеНаименование;
КонецПроцедуры
